app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "nick_name", "birthday", "user_adress", "email", "password_digest", "user_gender", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    p "================="
    p params[:user]
    p "================="
    params[:user][:birthday] = "#{params[:user]["birthday(1i)"]}/#{params[:user]["birthday(2i)"]}/#{params[:user]["birthday(3i)"]}"
    @user = User.new(user_params)
    if @user.save